{
    "format": "layers-model",
    "generatedBy": "keras v2.11.0",
    "convertedBy": "TensorFlow.js Converter v4.1.0",
    "modelTopology": {
        "keras_version": "2.11.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_3",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                32,
                                32,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "conv2d_13_input"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_13",
                            "trainable": true,
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                32,
                                32,
                                3
                            ],
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_13",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_14",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_14",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_15",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_15",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_16",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 16,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_16",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_17",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 8,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_17",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "same",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_3",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 3,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "conv2d_13/kernel",
                    "shape": [
                        3,
                        3,
                        3,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_13/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_14/kernel",
                    "shape": [
                        3,
                        3,
                        128,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_14/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_15/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_15/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_16/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_16/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_17/kernel",
                    "shape": [
                        3,
                        3,
                        16,
                        8
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_17/bias",
                    "shape": [
                        8
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/kernel",
                    "shape": [
                        8,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}